uhnp/src/Enums/ВидыФинансовыхИнструментов/ВидыФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыФинансовыхИнструментов</name>
  <enumValues>
    <name>РасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>КредитнаяЛиния</name>
  </enumValues>
  <enumValues>
    <name>КредитПолученный</name>
  </enumValues>
  <enumValues>
    <name>ЗаемПолученный</name>
  </enumValues>
  <enumValues>
    <name>Овердрафт</name>
  </enumValues>
  <enumValues>
    <name>ЗаемВыданный</name>
  </enumValues>
  <enumValues>
    <name>Депозит</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияПростая</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияВозобновляемая</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияОнкольная</name>
  </enumValues>
  <enumValues>
    <name>АккредитивВыданный</name>
  </enumValues>
  <enumValues>
    <name>АккредитивПолученный</name>
  </enumValues>
  <enumValues>
    <name>ГарантияВыданная</name>
  </enumValues>
  <enumValues>
    <name>ГарантияПолученная</name>
  </enumValues>
  <enumValues>
    <name>МНО</name>
  </enumValues>
  <enumValues>
    <name>Вексель</name>
  </enumValues>
  <enumValues>
    <name>Акция</name>
  </enumValues>
  <enumValues>
    <name>Облигация</name>
  </enumValues>
  <enumValues>
    <name>Факторинг</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеПривлечение</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>ВалютныйСвоп</name>
  </enumValues>
  <enumValues>
    <name>ВалютныйФорвард</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеЦенныеБумаги</name>
  </enumValues>
  <enumValues>
    <name>ВалютноПроцентныйСвоп</name>
  </enumValues>
  <enumValues>
    <name>ЛизингПолученный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыФинансовыхИнструментов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("ВидДоговора") Тогда
		
		ДанныеВыбора = ПолучитьДоступныеЗначенияПоВидуДоговора(Параметры.ВидДоговора);
		
	ИначеЕсли Параметры.Свойство("ЦеннаяБумага") Тогда
		
		ДанныеВыбора = ПолучитьВидыЦенныхБумаг();
	Иначе
		
		ДанныеВыбора = Новый СписокЗначений;
		Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыФинансовыхИнструментов.ЗначенияПеречисления Цикл
			
			Если СтрНачинаетсяС(Врег(ЗначениеПеречисления.Имя), "УДАЛИТЬ") Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(Перечисления.ВидыФинансовыхИнструментов[ЗначениеПеречисления.Имя]);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеЗначенияПоВидуДоговора(ВидДоговора = Неопределено)
	
	Результат = Новый СписокЗначений;
	
	ВидФИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДоговора, "ВидФинансовогоИнструмента");
	
	Если ЗначениеЗаполнено(ВидФИ) Тогда
		Результат.Добавить(ВидФИ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВидыЦенныхБумаг() Экспорт
	
	ДоступныеЗначения = Новый СписокЗначений;
	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.Вексель);	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.Облигация);	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.Акция);
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.ПрочиеЦенныеБумаги);
	
	Возврат ДоступныеЗначения;
	
КонецФункции

Функция ВидыБУЕРП() Экспорт

	ДоступныеЗначения = Новый СписокЗначений;
	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.РасчетыСКонтрагентами);	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.КредитнаяЛиния);	
	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.КредитПолученный);
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.ЗаемПолученный);
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.ЗаемВыданный);
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.Депозит);
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.Овердрафт);
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.МНО);
	
	ДоступныеЗначения.Добавить(Перечисления.ВидыФинансовыхИнструментов.ЛизингПолученный);
	
	Возврат ДоступныеЗначения;

КонецФункции

#КонецОбласти

#КонецЕсли
